---
type: ExportLineweightKey
namespace: Autodesk.Revit.DB
version: 2024
members: 5
tags: [revit-api, class]
---

# ExportLineweightKey

`Autodesk.Revit.DB.ExportLineweightKey` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ExportLineweightKey | — | `` |
| Constructor | ExportLineweightKey | 2014 | `public ExportLineweightKey ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | OriginalLineweight | 2014 | `public int OriginalLineweight { get ; set ; }` |